go-go-golems/esp32-s3-m5/0103-atoms3r-m12-native-quickjs/sdkconfig.defaults
# 0103 — AtomS3R M12 native QuickJS firmware with PSRAM.
# Target: ESP32-S3R8-class AtomS3R M12, USB Serial/JTAG console.
CONFIG_IDF_TARGET="esp32s3"

# AtomS3R M12 serial control plane: Espressif USB Serial/JTAG.
# Do not use the ESP32-P4 CH343 UART bridge for this firmware.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_CONSOLE_UART_NUM=-1

# AtomS3R-class flash baseline.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# CPU frequency: ESP32-S3 max frequency.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# PSRAM: AtomS3R M12 is expected to expose 8MB Octal PSRAM.
# Use a conservative 80MHz mode first; raise only after smoke tests pass.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Keep a roomy app partition for native QuickJS and future scripts/assets.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Main task stack: C++ + console bring-up headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
